benchmark/old_outputs/thread_equals_client/sieve/zipf_8/2026-04-19T20:23:51-04:00_1_9_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 8
number of threads: 8
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1914802
number of failed transactions: 0 (0.000%)
latency average = 0.752 ms
initial connection time = 3.311 ms
tps = 10637.897041 (without initial connection time)
SQL script 1: pgscripts/zipfian_select.sql
 - weight: 1 (targets 10.0% of total)
 - 191773 transactions (10.0% of total)
 - number of transactions actually processed: 191773 (tps = 1065.416387)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.099 ms
 - latency stddev = 0.015 ms
SQL script 2: pgscripts/zipfian_update.sql
 - weight: 9 (targets 90.0% of total)
 - 1721220 transactions (89.9% of total)
 - number of transactions actually processed: 1721220 (tps = 9562.430551)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.825 ms
 - latency stddev = 0.919 ms
ratio: .9996013911934828